Revit 2027 API
SolidglassTransmittanceType Enumeration
 The enumerated type representing the permitted values for the asset property "SolidglassTransmittance" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SolidglassTransmittanceType
Public Enumeration SolidglassTransmittanceType
public enum class SolidglassTransmittanceType
type SolidglassTransmittanceType
Members
Member name | Value | Description
Blue | 3
Bluegreen | 4
Bronze | 5
Clear | 0
CustomColor | 6
Gray | 2
Green | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace